/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面程序的功能是将一个数组中的元素按逆序存放，填空
      使程序完整。

-------------------------------------------------------*/
#include "stdio.h"

#define N 7
main()
{
 static int a[N]={12,9,16,5,7,2,1},k,s;
 printf("\n the origanal array:\n");
 for (k=0;k<N;k++)
    printf("%4d",a[k]);
/***********SPACE***********/
 for (k=0;k<N/2;k++)
 {
  s=a[k];
/***********SPACE***********/
 a[k]=a[N-1-k] ;
/***********SPACE***********/
  a[N-1-k]=s ;
  }
 printf("\n the changed array:\n");
 for (k=0;k<N;k++)
/***********SPACE***********/
	printf("%4d",a[k]);
 printf("\n");
}
