/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面程序的功能是用二分查找法找一个数是否在一个有序
      的数组中，填空使程序完整。

-------------------------------------------------------*/
#include "stdio.h"

main()
{  int key,mid,low,high;
   int a[]={15,34,48,56,65};
   printf("输入待查数据:\n");
   scanf("%d",&key);
   low=0,high=4;
/***********SPACE***********/
   while(low<=high)
   {
/***********SPACE***********/
            mid=(high+mid)/2;
        if(key==a[mid])
        {   printf("此数在数组中出现的位置为%d\n",mid);
            break;        
                }
        else if(key<a[mid])
/***********SPACE***********/
            high=mid-1;
        else
/***********SPACE***********/
                        low=mid+1;   
   }
   if(low>high) 
           printf("此数不在数组中\n");   
}
