/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：下面程序的功能是：判断您的体重是否超重。判断体重超重的方法是：
体重指数BMI=体重kg÷(身高m×身高m)
如果 若果BMI≥24体重超重，BMI<24 体重为正常或偏轻。
-------------------------------------------------------*/

#include <stdio.h>

main()
 {
/***********SPACE***********/
  float w,h,BMI;
  scanf("%f,%f", &w,&h);
/***********SPACE***********/
  BMI=w/(h*h);
/***********SPACE***********/
  if(BMI>=24) printf("您的体重超重\n");
/***********SPACE***********/
  else     printf("您的体重正常或偏轻\n");
 }
