/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面程序的功能是输入10个整数，并用选择排序方法
      对10个整数按降序排序，填空使程序完整。

-------------------------------------------------------*/

#include "stdio.h"

#define N 10 
main()
{
 int i,j,k,t,a[N];
 for(i=0;i<=N-1;i++)
/***********SPACE***********/
         scanf("%d",&a[i]);
 for(i=0;i<N-1;i++)
 {
/***********SPACE***********/
       k=i;
       for(j=i+1; j<N;j++)
/***********SPACE***********/
                   if(a[j]>a[k]) k=j;
          if(k!=i)
                  {
                          t=a[i];
/***********SPACE***********/
                          a[i]=a[k];
                          a[k]=t;
                  }
  }
 printf("output the sorted array:\n");
 for(i=0;i<=N-1;i++)
     printf("%5d",a[i]);
 printf("\n");
}
