/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面程序的功能是输入一个月份，输出该月的天数。
例如，如果输入10，则输出“10月有31天”。

-------------------------------------------------------*/

#include "stdio.h"

main()
{
  int  month,day;
  printf("请输入一个月份:");
/***********SPACE***********/
  scanf("%d",&month);
/***********SPACE***********/
  switch(month)
  {
/***********SPACE***********/
   case 1: case 3:  case 5:  case 7:  case 8:  case 10:  case 12: day=31;break;
   case 4: case 6:  case 9:  case 11: day=30;break;
   case 2:  day=28;break;
  }
/***********SPACE***********/
  printf("%d 月有 %d 天\n",month ,day);
 }
