/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面程序的功能是输出一个二维数组及每行的最大值与每行
      的和，填空使程序完整。

-------------------------------------------------------*/
#include "time.h"
#include "stdio.h"
#include "stdlib.h"

main()
{
 int a[5][5],b[5],c[5],i,j,k,s=0;
 srand(time(0));
 for(i=0;i<5;i++)
   for(j=0;j<5;j++)
     a[i][j]=rand( )%100+1;
 for(i=0;i<5;i++)
  { 
/***********SPACE***********/
   k=a[i][0]; s=0 ;
   for(j=0;j<5;j++)
    {
/***********SPACE***********/
     if(k<a[i][j]) k=a[i][j] ;
     s=s+a[i][j];
     }
    b[i]=k;
/***********SPACE***********/
   c[i]=s ;
   }
for(i=0;i<5;i++)
 {
  for(j=0;j<5;j++)
/***********SPACE***********/
     printf("%5d", a[i][j] );
  printf("    本行的最大值是%d，和是%d",b[i],c[i]);
  printf("\n");
 }
}
