/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：下面程序的功能是：由体重指数BMI判断成年人体重是否达标。
其中：体重指数BMI=体重kg÷(身高m×身高m)；
结论：超重：24≤BMI；正常：18.5≤BMI＜24；偏轻：BMI＜18.5。 
-------------------------------------------------------*/

#include <stdio.h>

main()
 {
/***********SPACE***********/
  float w,h,BMI;
  scanf("%f,%f", &w,&h );
/***********SPACE***********/
  BMI=w/(h*h);
  if(BMI>=24)  printf("您的体重超重\n");
/***********SPACE***********/
  else  if(BMI<18.5)  printf("您的体重偏轻\n");
/***********SPACE***********/
  else  printf("您的体重正常\n");
 }
