/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面程序的功能是从输入的整数数据中，统计大于零的整数
      个数和小于零的整数个数。用零来结束输入，程序中用变量
      i统计大于零的整数个数，用变量j统计小于零的整数个数，
      填空使程序完整。
-------------------------------------------------------*/
#include <stdio.h>

main()
{
        int n,i,j;
    printf("Enter INT number,with 0 to end\n");
    i=j=0;
    scanf("%d",&n);
    while(n!=0)
/***********SPACE***********/
        {if(n>0)i=i+1;
/***********SPACE***********/
        if(n<0)j=j+1;
/***********SPACE***********/
        scanf("%d",&n);
 }
/***********SPACE***********/
  printf("i=%4d,j=%4d\n",i,j);
}
