/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面程序的功能是输入10个整数，并用冒泡排序方法对10个
      整数按升序排序，填空使程序完整。

-------------------------------------------------------*/
#include "stdio.h"

#define N 10 
main()
{
 int i,j,t,a[N];
 for(i=0;i<=N-1;i++)
/***********SPACE***********/
         scanf("%d",&a[i]);
 for (j=0; j<N-1;j++)
   for (i=0; i<N-1-j;i++)
/***********SPACE***********/
      if(a[i]>a[i+1])
      {
                  t=a[i];
/***********SPACE***********/
              a[i]=a[i+1];
              a[i+1]=t;
          }
 printf("output the sorted array:\n");
 for(i=0;i<=N-1;i++)
/***********SPACE***********/
     printf("%5d",a[i]);
 printf("\n");
}
