/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：对一个已经有序的数组，插入一个新值后，数组依然有序。

-------------------------------------------------------*/

#include <stdio.h>

main()
{ 
        int i,n,m,a[11]={5,10,15,20,25,30,35,40,45,50};
        printf("原数组为\n");
        for(i=0;i<=9;i++)
        {
/***********SPACE***********/                
        printf("%d ",a[i]);
        }
        printf("\n");
        printf("请输入插入数组的值\n");
        scanf("%d",&n);
        for(i=0;i<=9;i++)
        {
                if(n<=a[i])
/***********SPACE***********/        
                break;
        }
        m=i;//记录插入位置
        for(i=10;i>m;i--)
/***********SPACE***********/
        a[i]=a[i-1];
/***********SPACE***********/
        a[i]=n;
        printf("插入新值后的数组为\n");
        for(i=0;i<=10;i++)
        {
                printf("%d ",a[i]);
        }
        printf("\n");
        
}
