/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写函数fun求正整数1到n之间（包括1和n）的所有3的倍数之和，n值
在主程序中输入，结果显示在屏幕上。
要求必须使用for循环。
--------------------------------------------------
注意：部分源程序已给出，请仅在Program与End之间填
      入所编写的若干语句，且勿改动其它位置的内容。
------------------------------------------------*/
#include<stdio.h>

int fun(int n) {
	/**********Program**********/
	int k = n / 3;
	return k * (3 + 3 * k) / 2;
	/**********  End  **********/
}

main() {
	int n;
	printf("【请输入n值:】");
	scanf("%d", &n);
	printf("%d\n", fun(n));
}
