/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写函数fun求一批正整数中的最大的奇数。

--------------------------------------------------
注意：部分源程序已给出，请仅在Program与End之间填
      入所编写的若干语句，且勿改动其它位置的内容。
------------------------------------------------*/
#include "stdio.h"

int fun(int a[], int n) {
	/**********Program**********/
	int max;
	for (int i = 0; i <= n; i++) {
		if (a[i] % 2 != 0) {
			if (a[i] > max) {
				max = a[i];
			}
		}
	}
	return max;
	/**********  End  **********/
}

main() {
	int a[] = {1, 2, 9, 24, 35, 18}, k;
	k = fun(a, 6);
	printf("%d\n", k);
}
