/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写函数fun计算n门课程的总分，计算结果作为函
      数值返回。

--------------------------------------------------
注意：部分源程序已给出，请仅在Program与End之间填
      入所编写的若干语句，且勿改动其它位置的内容。
------------------------------------------------*/


#include "stdio.h"

int fun(int a[], int n) {
	/**********Program**********/
	int sum;
	for (int i = 0; i < n; i++) {
		sum += a[i];
	}
	return sum;
	/**********  End  **********/
}

main() {
	int a[] = {92, 76, 69, 58, 88};
	printf("总分：%d\n", fun(a, 5));
}
