/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写函数fun求1到n之间（包括1和n）的偶数之和。

--------------------------------------------------
注意：部分源程序已给出，请仅在Program与End之间填
      入所编写的若干语句，且勿改动其它位置的内容。
------------------------------------------------*/
#include "stdio.h"

long fun(int n) {
	/**********Program**********/
	int k = n / 2;
	return k * (2 + 2 * k) / 2;
	/**********  End  **********/
}
main() {
	int n;
	printf("【请输入n值:】");
	scanf("%d", &n);
	printf("%ld\n", fun(n));
}
