/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写函数fun求正整数1到n的阶乘之积，n的值在主程序中
输入，结果显示在屏幕上。
要求必须使用for循环。
--------------------------------------------------
注意：部分源程序已给出，请仅在Program与End之间填
      入所编写的若干语句，且勿改动其它位置的内容。
------------------------------------------------*/
#include<stdio.h>

double fun(int n) {

	/**********Program**********/
	int s = 1;
	for (int i = 1; i <= n; i++) {
		s *= i;
	}
	return s;
	/**********  End  **********/
}

main() {
	int n;
	printf("【请输入n值:】");
	scanf("%d", &n);
	printf("%.0lf\n", fun(n));
}
