/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写函数fun求一维组数中最小元素值。

--------------------------------------------------
注意：部分源程序已给出，请仅在Program与End之间填
      入所编写的若干语句，且勿改动其它位置的内容。
------------------------------------------------*/
#include "stdio.h"

int fun(int a[], int n) {
	
	/**********Program**********/
	int min = a[0];
	for (int i = 1; i < n; i++) {
		if (a[i] < min) {
			min = a[i];
		}
	}
	return min;
	/**********  End  **********/

}

main() {
	int a[] = {13, 6, 24, 12, 36, 7}, k;
	k = fun(a, 6);
	printf("%d\n", k);
}
