/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

题目：下面给定程序中，函数fun的功能是：实现两个字符串的
      连接。
      例如：输入dfdfqe和12345时，则输出dfdfqe12345。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/


#include"stdio.h"

main()
{
 char s1[80],s2[80];
 void fun(char s1[],char s2[]);
 gets(s1);
 gets(s2);
 fun(s1,s2);
 puts(s1);
}

void fun(char s1[],char s2[])
{
 int i=0,j=0;
/**********FOUND**********/
 while(s1[i]!='\0') i++;
/**********FOUND**********/
 while(s2[j]!='\0')
    {
/**********FOUND**********/
     s1[i]=s2[j];
     i++;
     j++;
     }
/**********FOUND**********/
  s1[i]='\0';
}
