/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

题目：下面给定程序的功能是：计算给定学生的平均成绩、平均
      年龄以及有不及格成绩的人数。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/

#include "stdio.h"

/**********FOUND**********/
struct student
{  long num; 
   char name[12]; 
   char sex; 
   int age; 
   float score;
};

main()
{   int i,c;
    float save, aave;
    struct student stud[5]={{107151,"Zhang",'F',20,98.0}, 
        {107153,"Wang",'M',19,95.5},{107154,"Li",'F',19,70.0}, 
        {107155,"Zhao",'F',18,55.0},{107159,"Liu",'M',21,75.0}};
        save=0;
        aave=0;
/**********FOUND**********/
        c=0;
/**********FOUND**********/
    for(i=0;i<5;i++)
    {    save+=stud[i].score ; 
             aave+=stud[i].age ;
/**********FOUND**********/
         if(stud[i].score<60) c++; 
    }
    save=save/5; 
        aave=aave/5; 
    printf("平均成绩=%5.1f\n平均年龄=%4.1f\n不及格成绩的人数=%d\n",save,aave,c);
}
