/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

题目：从键盘输入一些字符，逐个把它们送到磁盘上去，
直到输入一个#为止。
      
--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/

#include "stdio.h"
#include "stdlib.h"

main()
/**********FOUND**********/
{ FILE  *fp;
  char ch,filename[10];
  scanf("%s",filename);
/**********FOUND**********/
  if((fp=fopen(filename,"W"))==NULL)
   {printf("cannot open file\n");
    exit(0);}
  ch=getchar();
  ch=getchar();
/**********FOUND**********/
  while(ch!='#')
    {fputc(ch,fp);putchar(ch);
     ch=getchar();
    }
/**********FOUND**********/
  fclose(fp);
}
