/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

题目：下面程序的功能是求如下表达式：
     
               1       1                     1
      S = 1 + —— + ——— + ...... + ——————— 
              1+2    1+2+3             1+2+3+......+n  

      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/


#include <stdio.h>

main()
{
 int n;
 float fun(int);
 printf("Please input a number:");
/**********FOUND**********/
 scanf("%d",&n) ;                              
 printf("%10.6f\n",fun(n));
}
/**********FOUND**********/
float fun(int n)                                   
{
 int i,j,t;
 float s;
 s=0;
/**********FOUND**********/
 for(i=1;i<=n;i++);                            
 {
  t=0;
  for(j=1;j<=i;j++)
  t=t+j;
/**********FOUND**********/
  s=+1.0/t;
  }                                   
 return s;
}
