/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

题目：下面给定程序中，函数fun的功能是：根据整型形参m，
      计算某一数据项的值。
      y = 1/(100*100)+1/(200*200)+
      1/(300*300)  + …… + 1/(m*m)
      例如，若m = 2000，则应输出： 0.000160。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/

#include<stdio.h>

/**********FOUND**********/
double fun( int m )
{ double y = 0, d ;
int i ;
/**********FOUND**********/
 for( i = 100; i <= m; i += 100 )
{ d = (double)i * (double)i ;
/**********FOUND**********/
y += 1.0 / d ;
}
/**********FOUND**********/
return(y) ;
} 

main()
{ int n = 2000 ;
  printf( "\nThe result is %lf\n", fun ( n ) ) ;
}
