/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

题目：下面给定程序中，函数fun的功能是：求矩阵（3行3列）
      与10的乘积。例如, 输入下面的矩阵: 

      10 20 30     
      40 50 60     
      70 80 90 

      程序输出:   

      100 200 300
      400 500 600 
      700 800 900
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/
#include "stdio.h"

void fun(int array[3][3])     
{
/**********FOUND**********/ 
int i,j;
for(i=0; i < 3; i++)
for(j=0; j < 3; j++)
/**********FOUND**********/     
array[i][j]=10;
}

main()
{     
int i,j;     
int array[3][3]={{10,20,30},     
{40,50,60},     
{70,80,90}};     
for (i=0; i < 3; i++)     
{ for (j=0; j < 3; j++)     
printf("%7d",array[i][j]=array[i][j]*10);
/**********FOUND**********/      
printf("\n");     
}
/**********FOUND**********/      
fun(array);    
printf("Converted array:\n");     
for (i=0; i < 3; i++)     
{ for (j=0; j < 3; j++)     
printf("%7d",array[i][j]);     
printf("\n");
}
}
