/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

题目：下面给定程序中，函数fun的功能是：计算正整数num的
      各个位上的数字之积。
      例如，若输入252，则应输出20；若输入202，则应输出0。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/
#include <stdio.h>

long fun(long num)
/**********FOUND**********/
{long k=1;

do
{ k*=num%10 ;
/**********FOUND**********/
num/=10;
/**********FOUND**********/
} while(num!=0) ;
return (k) ;
}

main()
{ long n ;
printf("请输入一个数:") ;
/**********FOUND**********/
scanf("%ld",&n) ;
printf("\n%ld\n",fun(n)) ;
}
