/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

题目：下面给定程序的功能是：从键盘输入学生的学号，姓名
      和三门课成绩，调用函数求平均成绩。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/

#include "stdio.h"

/**********FOUND**********/
struct stu
{   long num;     
    char name[12];   
    int score[3];
};
float aver(struct stu ss)
{  float f;
   f=(ss.score[0]+ss.score[1]+ss.score[2])/3.0;
/**********FOUND**********/
   return f; 
}
main()
/**********FOUND**********/
{  struct stu s;
   float a;
   scanf("%ld",&s.num);
/**********FOUND**********/
   scanf("%s",s.name);
   scanf("%d%d%d",&s.score[0],&s.score[1],&s.score[2]);
   a=aver(s);
   printf("学号=%ld 姓名=%s 成绩=%d %d %d\n",s.num,s.name,s.score[0],s.score[1],s.score[2]);
   printf("平均成绩=%5.1f\n",a);
}
