/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

题目：下面给定程序中，函数fun的功能是：找出大于m的最小
      素数，并将其作为函数值返回。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/
#include <math.h>
#include "stdio.h"

int fun(int m)
{
/**********FOUND**********/ 
 int i,k;
  for(i=m+1;;i++)
  {
   for(k=2;k<i;k++)
/**********FOUND**********/
     if(i%k==0) break;
/**********FOUND**********/
     if(i<=k)
/**********FOUND**********/
   return i;
    }
}
main()
{
 int n;
 printf("请输入一个大于0的整数:");
 scanf("%d",&n);
 if(n<1)
     printf("输入错误!");
 else
     printf("%d\n",fun(n));
}
