/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------

题目：下面给定程序的功能是：通过函数的递归调用计算阶乘。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/

#include "stdio.h"

/**********FOUND**********/
long power(int n)
{  long f;
   if(n>1)
/**********FOUND**********/
      f=power(n-1)*n;
   else  f=1;
   return f;
}

main()
{   int n;
    long y;
    printf("input a inteager number:\n");
/**********FOUND**********/
    scanf("%d",&n);
/**********FOUND**********/
    y=power(n);
    printf("%d!=%ld\n",n,y);

}
