/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------

题目：已知一个数列的前三项分别为0、0、1，以后的各项都是
      其相邻的前三项的和。
      下面给定程序中，函数fun的功能是：计算并输出该数列
      的前n项的平方根之和sum，n的值通过形参传入。
      例如，当n=10时，程序的输出结果应为23.197745。
      请改正程序中的错误，使程序能得到正确的运行结果。

--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/


#include "math.h"
#include "stdio.h"

/**********FOUND**********/
double fun(int n)
{
 double sum,s0,s1,s2,s;
 int k;
/**********FOUND**********/
 sum=1.0;
 if(n<=2) sum=0.0;
  s0=0.0;
  s1=0.0;
/**********FOUND**********/
  s2=1.0;
 for(k=4;k<=n;k++)
  {
   s=s0+s1+s2;
   sum+=sqrt(s);
   s0=s1;s1=s2;s2=s;
   }
/**********FOUND**********/
  return sum;
}
main()
{
 int n;
 scanf("%d",&n);
 printf("%lf\n",fun(n));
}
